In [1]:
<img src='Data/ERD.png'

SyntaxError: invalid syntax (235910161.py, line 1)

In [27]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sqlalchemy import create_engine,Table, Column, Integer, String, MetaData, VARCHAR
from sqlalchemy_utils import create_database, database_exists
import pymysql
pymysql.install_as_MySQLdb()

## Change username and password to match your personal MySQL Server settings
#username = 'root' # default username for MySQL db is root
#password = 'Dino2010' # whatever password you chose during MySQL installation.

In [28]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
username = "root"
password = "Dino2010" # (or whatever password you chose during mysql installation)
db_name = "book"

connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [29]:
engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/book)

In [30]:
#create_database(connection)

In [31]:
database_exists(connection)

True

In [32]:
# checking if the database exists. If not, create it. 
if database_exists(connection) == False:
    create_database(connection)
else:
    print('The database already exists')

The database already exists

In [33]:
df = pd.read_csv('Data/data.csv')
df.head()

,First Name,Last Name,Email,Book Title,Book Author
0,John,Doe,JD@books.com,The Shining,Stephen King
1,John,Doe,JD@books.com,It,Stephen King
2,John,Doe,JD@books.com,The Great Gatsby,F. Scott Fitzgerald
3,Robin,Smith,Robin@books.com,The Call of the Wild,Jack London
4,Robin,Smith,Robin@books.com,Pride and Prejudice,Jane Austen

In [36]:
df_user = pd.read_csv('Data/user.csv')

In [37]:
df_user = pd.read_csv('Data/user.csv')
df_user.to_sql('user', con=engine, if_exists='replace', index=False)

3

In [38]:
df_books = pd.read_csv('Data/books.csv')
df_books.to_sql('books', con=engine, if_exists='replace', index=False)

6

In [41]:
df_authors = pd.read_csv('Data/authors.csv')
df_authors.to_sql('authors', con=engine, if_exists='replace', index=False)

5

In [42]:
df_favorites = pd.read_csv('Data/favorites.csv')
df_favorites.to_sql('favorites', con=engine, if_exists='replace', index=False)

7

In [43]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

Exception during reset or similar
Traceback (most recent call last):
  File "/opt/anaconda3/envs/dojo-env/lib/python3.9/site-packages/pymysql/connections.py", line 732, in _read_bytes
    data = self._rfile.read(num_bytes)
  File "/opt/anaconda3/envs/dojo-env/lib/python3.9/socket.py", line 704, in readinto
    return self._sock.recv_into(b)
ConnectionResetError: [Errno 54] Connection reset by peer

During handling of the above exception, another exception occurred:

Traceback (most recent call last):
  File "/opt/anaconda3/envs/dojo-env/lib/python3.9/site-packages/sqlalchemy/pool/base.py", line 739, in _finalize_fairy
    fairy._reset(pool)
  File "/opt/anaconda3/envs/dojo-env/lib/python3.9/site-packages/sqlalchemy/pool/base.py", line 988, in _reset
    pool._dialect.do_rollback(self)
  File "/opt/anaconda3/envs/dojo-env/lib/python3.9/site-packages/sqlalchemy/engine/default.py", line 682, in do_rollback
    dbapi_connection.rollback()
  File "/opt/anaconda3/envs/dojo-env/lib/python3.9/site-packages/pymysql/connections.py", line 480, in rollback
    self._read_ok_packet()
  File "/opt/anaconda3/envs/dojo-env/lib/python3.9/site-packages/pymysql/connections.py", line 443, in _read_ok_packet
    pkt = self._read_packet()
  File "/opt/anaconda3/envs/dojo-env/lib/python3.9/site-packages/pymysql/connections.py", line 692, in _read_packet
    packet_header = self._read_bytes(4)
  File "/opt/anaconda3/envs/dojo-env/lib/python3.9/site-packages/pymysql/connections.py", line 738, in _read_bytes
    raise err.OperationalError(
pymysql.err.OperationalError: (2013, 'Lost connection to MySQL server during query ([Errno 54] Connection reset by peer)')

  Tables_in_book
0        authors
1          books
2           data
3      favorites
4           user

In [50]:
engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/book)

In [51]:
q = """SELECT * FROM data;"""
pd.read_sql(q, engine)

,index,First Name,Last Name,Email,Book Title,Book Author
0,0,John,Doe,JD@books.com,The Shining,Stephen King
1,1,John,Doe,JD@books.com,It,Stephen King
2,2,John,Doe,JD@books.com,The Great Gatsby,F. Scott Fitzgerald
3,3,Robin,Smith,Robin@books.com,The Call of the Wild,Jack London
4,4,Robin,Smith,Robin@books.com,Pride and Prejudice,Jane Austen
5,5,Gloria,Rodriguez,grodriguez@books.com,Pride and Prejudice,Jane Austen
6,6,Gloria,Rodriguez,grodriguez@books.com,Frankenstein,Mary Shelley

In [54]:
q = """SELECT * FROM user;"""
pd.read_sql(q, engine)

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com